IDEA Open Model
CheckResSummary Properties
The CheckResSummary type exposes the following members.
Properties
Name | Description
CheckStatus
 Status of check
CheckValue
 Check value
LoadCaseId |  Obsolete.
 Id of Load Case
Name
 Name
UnityCheckMessage
 Detail message about overall check
Top
See Also
Reference
CheckResSummary Class
IdeaRS.OpenModel.Connection Namespace